Revit 2027 API
StairsPathType.EndAtRiser Property
 Represents whether the stairs path ends at the riser.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool EndAtRiser { get; set; }
Public Property EndAtRiser As Boolean
	Get
	Set
public:
property bool EndAtRiser {
	bool get ();
	void set (bool value);
}
member EndAtRiser : bool with get, set
Property Value
Boolean
Exceptions
Exception | Condition
InvalidOperationException |  When setting this property: The StairsPathType is not fixed up direction so the data being set is not applicable.
See Also
Reference
StairsPathType Class
Autodesk.Revit.DB.Architecture Namespace